'''Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn.
Пример:
Введите число n: 3
n + nn + nnn = 369'''

'''Для решения этой задачи, числа были записаны как строки, а потом возвращены целыми числами'''

n = int(input('Введите целое положительное число: ' ))
a = int(str(n)+str(n))
b = int(str(n)+str(n)+str(n))
print(n+a+b)

