'''Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |'''

n = int(input('Введите положительное трёхзначное число: '))
sumN = 0
while n != 0:
    a = n % 10
    sumN += a
    n=n//10
print(sumN)